#include <iostream>
#include "lib.h"

int main(){
    std::cout << "'1' - вызов функции подсчёта НОД для двух натуральных чисел." << "\n"
    << "'2' - вызов функции подсчета количества простых чисел на отрезке [A, B]" << "\n"
    << "'-1' - окончание работы программы." << "\n" << "\n"
    << "Введите номер команды: ";

    int num;
    std::cin >> num;

    while (num != -1){
        switch (num){
            
            case 1:
                int a, b;
                std::cout << "Введите два натуральных числа: ";
                std::cin >> a >> b;

                std::cout << "НОД(" << a << "," << b << ") = " << GCF(a, b) << "\n" << "\n"
                << "Введите номер команды: ";
                std::cin >> num;
                break;

            case 2:
                int A, B;
                std::cout << "Введите концы отрезка А и В: ";
                std::cin >> A >> B;

                std::cout << "Количество простых чисел на отрезке [A, B]: " << PrimeCount(A, B)<< "\n" << "\n"
                << "Введите номер команды: ";

                std::cin >> num;
                break;

            default:
                std::cout << "Команды с таким номером нет." << "\n";
                return -1;
        }
    }
    return 0;
}